CommunityGD32Cores/gigadevice-firmware-and-docs/GD32W51x/GD32W51x_RELEASE_V1.0.0/NSPE/Example/USBFS/usb_device/audio/src/audio_codec.c
        /* call the audio codec pause/resume function */
        if (0U != codec_pause_resume(cmd)) {
            return 1U;
        } else {
            return 0U;
        }
    } else {
        /* call the Audio Codec Pause/Resume function */
        if (0U != codec_pause_resume(cmd)) {
            return 1U;
        } else {
            /* call the Media layer pause/resume function */
            audio_mal_pause_resume(cmd, addr, size);

            /* Return 0 if all operations are OK */
            return 0U;
        }
    }
}

/*!
    \brief      stops audio playing and power down the audio codec
    \param[in]  option: can be
      \arg        CODEC_PDWN_SW for software power off (by writing registers)
                  then no need to reconfigure the codec after power on
      \arg        CODEC_PDWN_HW completely shut down the codec (physically). Then need 
                  to reconfigure the Codec after power on
    \param[out] none
    \retval     0 if correct communication, else wrong communication
*/
uint32_t eval_audio_stop (uint32_t option)
{
    /* call audio codec stop function */
    if (0U != codec_stop(option)) {
        return 1U;
    } else {
        /* call media layer stop function */
        audio_mal_stop();

        /* update the remaining data number */
        audio_remsize = audio_totalsize;    

        /* return 0 when all operations are correctly done */
        return 0U;
    }
}

/*!
    \brief      controls the current audio volume level
    \param[in]  volume: volume level to be set in percentage from 0% to 100% (0 for 
                mute and 100 for max volume level)
    \param[out] none
    \retval     0 if correct communication, else wrong communication
*/
uint32_t eval_audio_volume_ctl(uint8_t volume)
{
    /* call the codec volume control function with converted volume value */
    return (codec_volume_ctrl(VOLUME_CONVERT(volume)));
}

/*!
    \brief      enable or disable the mute mode by software
    \param[in]  cmd: could be audio_mute_on to mute sound or audio_mute_off to 
                unmute the codec and restore previous volume level
    \param[out] none
    \retval     0 if correct communication, else wrong communication
*/
uint32_t eval_audio_mute (uint32_t cmd)
{
    /* call the Codec Mute function */
    return (codec_mute(cmd));
}

/*!
    \brief      this function handles main media layer interrupt
    \param[in]  none
    \param[out] none
    \retval     0 if correct communication, else wrong communication
*/
void Audio_MAL_IRQHandler(void)
{
#ifndef AUDIO_MAL_MODE_NORMAL
    uint16_t *addr = (uint16_t *)current_pos;
    uint32_t size = audio_remsize;
#endif /* AUDIO_MAL_MODE_NORMAL */

#ifdef AUDIO_MAL_DMA_IT_TC_EN
    /* Transfer complete interrupt */
    if (RESET != dma_flag_get(AUDIO_MAL_DMA_STREAM, AUDIO_MAL_DMA_FLAG_TC))
    {
#ifdef AUDIO_MAL_MODE_NORMAL
        /* Check if the end of file has been reached */
        if (audio_remsize > 0U) {
            /* Wait the DMA Stream to be effectively disabled */
            while (DMA_GetCmdStatus(AUDIO_MAL_DMA_STREAM) != DISABLE) {}

            /* Clear the Interrupt flag */
            DMA_ClearFlag(AUDIO_MAL_DMA_STREAM, AUDIO_MAL_DMA_FLAG_TC);  

            /* Re-Configure the buffer address and size */
            dma_initstructure.DMA_Memory0BaseAddr = (uint32_t) current_pos;
            dma_initstructure.DMA_BufferSize = (uint32_t) (DMA_MAX(audio_remsize));

            /* Configure the DMA Stream with the new parameters */
            DMA_Init(AUDIO_MAL_DMA_STREAM, &dma_initstructure);

            /* Enable the I2S DMA Stream*/
            DMA_Cmd(AUDIO_MAL_DMA_STREAM, ENABLE);

            /* Update the current pointer position */
            current_pos += DMA_MAX(audio_remsize);

            /* Update the remaining number of data to be played */
            audio_remsize -= DMA_MAX(audio_remsize);
        } else {
            /* Disable the I2S DMA Stream*/
            DMA_Cmd(AUDIO_MAL_DMA_STREAM, DISABLE);   

            /* Clear the Interrupt flag */
            DMA_ClearFlag(AUDIO_MAL_DMA_STREAM, AUDIO_MAL_DMA_FLAG_TC);

            /* Manage the remaining file size and new address offset: This function 
            should be coded by user (its prototype is already declared in gd32f150r_audio_codec.h) */  
            EVAL_AUDIO_TransferComplete_CallBack((uint32_t)current_pos, 0U);
        }

#elif defined(AUDIO_MAL_MODE_CIRCULAR)
        /* Manage the remaining file size and new address offset: This function 
           should be coded by user (its prototype is already declared in gd32f150r_audio_codec.h) */  
        eval_audio_transfercomplete_callback(pAddr, Size);    

        /* Clear the Interrupt flag */
        DMA_ClearFlag(AUDIO_MAL_DMA_STREAM, AUDIO_MAL_DMA_FLAG_TC);
#endif /* AUDIO_MAL_MODE_NORMAL */  
    }
#endif /* AUDIO_MAL_DMA_IT_TC_EN */

#ifdef AUDIO_MAL_DMA_IT_HT_EN
    /* half transfer complete interrupt */
    if (RESET != DMA_GetFlagStatus(AUDIO_MAL_DMA_STREAM, AUDIO_MAL_DMA_FLAG_HT))
    {
        /* Manage the remaining file size and new address offset: This function 
           should be coded by user (its prototype is already declared in gd32f150r_audio_codec.h) */  
        eval_audio_halftransfer_callback((uint32_t)addr, size);

        /* Clear the Interrupt flag */
        DMA_ClearFlag(AUDIO_MAL_DMA_STREAM, AUDIO_MAL_DMA_FLAG_HT);
    }
#endif /* AUDIO_MAL_DMA_IT_HT_EN */
  
#ifdef AUDIO_MAL_DMA_IT_TE_EN  
    /* FIFO Error interrupt */
    if ((RESET != DMA_GetFlagStatus(AUDIO_MAL_DMA_STREAM, AUDIO_MAL_DMA_FLAG_TE) ) || \
        (RESET != DMA_GetFlagStatus(AUDIO_MAL_DMA_STREAM, AUDIO_MAL_DMA_FLAG_FE) ) || \
        (RESET != DMA_GetFlagStatus(AUDIO_MAL_DMA_STREAM, AUDIO_MAL_DMA_FLAG_DME))) {
       /* manage the error generated on DMA FIFO: This function 
          should be coded by user (its prototype is already declared in gd32f150r_audio_codec.h) */  
        eval_audio_error_callback((uint32_t*)&addr);

        /* clear the interrupt flag */
        DMA_ClearFlag(AUDIO_MAL_DMA_STREAM, AUDIO_MAL_DMA_FLAG_TE | AUDIO_MAL_DMA_FLAG_FE | \
                      AUDIO_MAL_DMA_FLAG_DME);
    }
#endif /* AUDIO_MAL_DMA_IT_TE_EN */
}

/* PCM1770 Audio Codec Control Functions */

/*!
    \brief      initializes the audio codec and all related interfaces (control 
                interface: i2c and audio interface: i2s)
    \param[in]  output_device:
      \arg        OUTPUT_DEVICE_SPEAKER
      \arg        OUTPUT_DEVICE_HEADPHONE
      \arg        OUTPUT_DEVICE_BOTH
      \arg        OUTPUT_DEVICE_AUTO
    \param[in]  volume: initial volume level (from 0 (mute) to 100 (max))
    \param[in]  audiofreq: audio frequency used to play the audio stream
    \param[out] none
    \retval     0 if correct communication, else wrong communication
*/
uint32_t codec_init(uint16_t output_device, uint8_t volume, uint32_t audio_freq)
{
    uint32_t counter = 0U;

    /* configure the codec related IOs */
    codec_gpio_init();

    /* reset the codec registers */
    codec_reset();

