CommunityGD32Cores/gigadevice-firmware-and-docs/GD32W51x/GD32W51x_RELEASE_V1.0.0/NSPE/Example/USBFS/usb_device/audio/src/audio_codec.c
    /* initialize the control interface of the audio codec */
    codec_ctrl_interface_init();

    /* keep codec powered off */
    counter += codec_write_register(0x02U, 0x01U);

    switch (output_device) {
    case OUTPUT_DEVICE_SPEAKER:
        counter += codec_write_register(0x04U, 0xFAU); /* SPK always ON & HP always OFF */
        output_dev = 0xFAU;
        break;
    case OUTPUT_DEVICE_HEADPHONE:
        counter += codec_write_register(0x04U, 0xAFU); /* SPK always OFF & HP always ON */
        output_dev = 0xAFU;
        break;
    case OUTPUT_DEVICE_BOTH:
        counter += codec_write_register(0x04U, 0xAAU); /* SPK always ON & HP always ON */
        output_dev = 0xAAU;
        break;
    case OUTPUT_DEVICE_AUTO:
        counter += codec_write_register(0x04U, 0x05U); /* detect the HP or the SPK automatically */
        output_dev = 0x05U;
        break;
    default:
        counter += codec_write_register(0x04U, 0x05U); /* detect the HP or the SPK automatically */
        output_dev = 0x05U;
        break;
    }

    /* clock configuration: auto detection */
    counter += codec_write_register(0x05U, 0x81U);

    /* set the slave mode and the audio standard */
    counter += codec_write_register(0x06U, CODEC_STANDARD);

    /* set the master volume */
    codec_volume_ctrl(volume);

    /* if the Speaker is enabled, set the Mono mode and volume attenuation level */
    if (output_device != OUTPUT_DEVICE_HEADPHONE) {
        /* Set the Speaker Mono mode */
        counter += codec_write_register(0x0FU, 0x06U);

        /* Set the Speaker attenuation level */
        counter += codec_write_register(0x24U, 0x00U);
        counter += codec_write_register(0x25U, 0x00U);
    }

    /* power on the Codec */
    counter += codec_write_register(0x02U, 0x9EU);

    /* Additional configuration for the CODEC. These configurations are done to reduce
       the time needed for the Codec to power off. If these configurations are removed,
       then a long delay should be added between powering off the Codec and switching
       off the I2S peripheral MCLK clock (which is the operating clock for Codec).
       If this delay is not inserted, then the codec will not shut down propoerly and
       it results in high noise after shut down. */

    /* disable the analog soft ramp */
    counter += codec_write_register(0x0AU, 0x00U);

    /* disable the digital soft ramp */
    counter += codec_write_register(0x0EU, 0x04U);

    /* disable the limiter attack level */
    counter += codec_write_register(0x27U, 0x00U);

    /* adjust bass and treble levels */
    counter += codec_write_register(0x1FU, 0x0FU);

    /* adjust pcm volume level */
    counter += codec_write_register(0x1AU, 0x0AU);
    counter += codec_write_register(0x1BU, 0x0AU);

    /* configure the i2s peripheral */
    codec_audio_interface_init(audio_freq);

    /* return communication control value */
    return counter;
}

/*!
    \brief      restore the audio codec state to default state and free all used resources
    \param[in]  none
    \param[out] none
    \retval     0 if correct communication, else wrong communication
*/
uint32_t codec_deinit(void)
{
    uint32_t counter = 0U;

    /* reset the codec registers */
    codec_reset();

    /* keep codec powered off */
    counter += codec_write_register(0x02U, 0x01U);

    /* deinitialize all use IOs */
    codec_gpio_deinit();

    /* disable the codec control interface */
    codec_ctrl_interface_deinit();

    /* deinitialize the codec audio interface (i2s) */
    codec_audio_interface_deinit();

    /* return communication control value */
    return counter;
}

/*!
    \brief      start the audio codec play feature
                for this codec no play options are required
    \param[in]  none
    \param[out] none
    \retval     0 if correct communication, else wrong communication
*/
uint32_t codec_play(void)
{
    /* no actions required on codec level for play command */

    /* return communication control value */
    return 0U;
}

/*!
    \brief      pauses and resumes playing on the audio codec
    \param[in]  cmd: AUDIO_PAUSE (or 0) to pause, AUDIO_RESUME (or any value different
                from 0) to resume
    \param[out] none
    \retval     0 if correct communication, else wrong communication
*/
uint32_t codec_pause_resume(uint32_t cmd)
{
    uint32_t counter = 0U;

    /* pause the audio file playing */
    if (AUDIO_PAUSE == cmd) {
        /* mute the output first */
        counter += codec_mute(AUDIO_MUTE_ON);

        /* put the codec in power save mode */
        counter += codec_write_register(0x02U, 0x01U);
    } else {
        /* unmute the output first */
        counter += codec_mute(AUDIO_MUTE_OFF);

        counter += codec_write_register(0x04U, (uint32_t)output_dev);

        /* exit the power save mode */
        counter += codec_write_register(0x02U, 0x9EU); 
    }

    return counter;
}

/*!
    \brief      stops audio codec playing. it powers down the codec
    \param[in]  codec_pdwn_mode:
      \arg        CODEC_PDWN_SW: only mutes the audio codec. when resuming from this 
                  mode the codec keeps the previous initialization (no need to re-initialize
                  the codec registers)
      \arg        CODEC_PDWN_HW: physically power down the codec. when resuming from this
                  mode, the codec is set to default configuration (user should re-initialize
                  the codec in order to play again the audio stream)
    \param[out] none
    \retval     0 if correct communication, else wrong communication
*/
uint32_t codec_stop(uint32_t codec_pdwn_mode)
{
    uint32_t counter = 0U;

    /* mute the output first */
    codec_mute(AUDIO_MUTE_ON);

    if (CODEC_PDWN_SW == codec_pdwn_mode) {
        /* power down the dac and the speaker (pmdac and pmspk bits)*/
        counter += codec_write_register(0x02U, 0x9FU);
    } else {
        /* power down the dac components */
        counter += codec_write_register(0x02U, 0x9FU);

        /* wait at least 100ms */
        delay(0xFFFU);
    }

