CommunityGD32Cores/gigadevice-firmware-and-docs/GD32W51x/GD32W51x_RELEASE_V1.0.0/NSPE/Example/USBFS/usb_device/audio/src/audio_codec.c
    return counter;
}

/*!
    \brief      higher or lower the codec volume level
    \param[in]  volume: a byte value from 0 to 255 (refer to codec registers 
                description for more details)
    \param[out] none
    \retval     0 if correct communication, else wrong communication
*/
uint32_t codec_volume_ctrl(uint8_t volume)
{
    uint32_t counter = 0U;

    if (volume > 0xE6U) {
        /* set the master volume */
        counter += codec_write_register(0x20U, volume - 0xE7U);
        counter += codec_write_register(0x21U, volume - 0xE7U);
    } else {
        /* set the master volume */
        counter += codec_write_register(0x20U, volume + 0x19U);
        counter += codec_write_register(0x21U, volume + 0x19U);
    }

    return counter;
}

/*!
    \brief      enables or disables the mute feature on the audio codec
    \param[in]  cmd: AUDIO_MUTE_ON to enable the mute or AUDIO_MUTE_OFF to disable the
                mute mode
    \param[out] none
    \retval     0 if correct communication, else wrong communication
*/
uint32_t codec_mute(uint32_t cmd)
{
    uint32_t counter = 0U;

    /* set the mute mode */
    if (AUDIO_MUTE_ON == cmd)
    {
        counter += codec_write_register(0x04U, 0xFFU);
    } else {
        counter += codec_write_register(0x04U, (uint32_t)output_dev);
    }

    return counter;
}

/*!
    \brief      switch dynamically (while audio file is played) the output target (speaker or headphone)
    \note       this function modifies a global variable of the audio codec driver: output_dev.
    \param[in]  none
    \param[out] none
    \retval     0 if correct communication, else wrong communication
*/
uint8_t codec_switch_output(uint8_t output)
{
    uint8_t counter = 0U;

    switch (output) {
    case OUTPUT_DEVICE_SPEAKER:
        counter += codec_write_register(0x04U, 0xFAU); /* SPK always ON & HP always OFF */
        output_dev = 0xFAU;
        break;
    case OUTPUT_DEVICE_HEADPHONE:
        counter += codec_write_register(0x04U, 0xAFU); /* SPK always OFF & HP always ON */
        output_dev = 0xAFU;
        break;
    case OUTPUT_DEVICE_BOTH:
        counter += codec_write_register(0x04U, 0xAAU); /* SPK always ON & HP always ON */
        output_dev = 0xAAU;
        break;
    case OUTPUT_DEVICE_AUTO:
        counter += codec_write_register(0x04U, 0x05U); /* detect the HP or the SPK automatically */
        output_dev = 0x05U;
        break;
    default:
        counter += codec_write_register(0x04U, 0x05U); /* detect the HP or the SPK automatically */
        output_dev = 0x05U;
        break;
    }

    return counter;
}

#ifdef USE_DEFAULT_TIMEOUT_CALLBACK

/*!
    \brief      basic management of the timeout situation
    \param[in]  none
    \param[out] none
    \retval     none
*/
uint32_t Codec_TIMEOUT_UserCallback(void)
{
    /* block communication and all processes */
    while (1){
    }
}

#endif /* USE_DEFAULT_TIMEOUT_CALLBACK */

/* Audio MAL Interface Control Functions */

/*!
    \brief      initializes and prepares the Media to perform audio data transfer 
                from Media to the I2S peripheral
    \param[in]  none
    \param[out] none
    \retval     none
*/
void audio_mal_init(void)
{
#if defined(AUDIO_MAL_DMA_IT_TC_EN) || defined(AUDIO_MAL_DMA_IT_HT_EN) || defined(AUDIO_MAL_DMA_IT_TE_EN)
    NVIC_InitTypeDef NVIC_InitStructure;
#endif

    /* enable the DMA clock */
    rcu_periph_clock_enable(AUDIO_MAL_DMA_CLOCK);

    /* configure the DMA Stream */
    dma_channel_enable(AUDIO_MAL_DMA, AUDIO_MAL_DMA_CHANNEL);
    dma_deinit(AUDIO_MAL_DMA, AUDIO_MAL_DMA_CHANNEL);

    /* set the parameters to be configured */
    dma_initstructure.periph_addr = CODEC_I2S_ADDRESS;
    dma_initstructure.memory0_addr = (uint32_t)0U;/* this field will be configured in play function */
    dma_initstructure.direction = DMA_MEMORY_TO_PERIPH;
    dma_initstructure.number = (uint32_t)0xFFFEU;/* this field will be configured in play function */
    dma_initstructure.periph_inc = DMA_PERIPH_INCREASE_DISABLE;
    dma_initstructure.memory_inc = DMA_MEMORY_INCREASE_ENABLE;
    dma_initstructure.periph_memory_width = AUDIO_MAL_DMA_PERIPH_DATA_SIZE;
    dma_initstructure.circular_mode = DMA_CIRCULAR_MODE_DISABLE;

    dma_initstructure.priority = DMA_PRIORITY_HIGH;
    dma_single_data_mode_init(AUDIO_MAL_DMA, AUDIO_MAL_DMA_CHANNEL, &dma_initstructure);
    dma_channel_subperipheral_select(AUDIO_MAL_DMA, AUDIO_MAL_DMA_CHANNEL, DMA_SUBPERI0);

    /* enable the selected dma interrupts (selected in "gd32f150r_audio_codec.h" defines) */
#ifdef AUDIO_MAL_DMA_IT_TC_EN
    dma_interrupt_enable(AUDIO_MAL_DMA_CHANNEL, DMA_INT_FTF);
#endif /* AUDIO_MAL_DMA_IT_TC_EN */

#ifdef AUDIO_MAL_DMA_IT_HT_EN
    DMA_ITConfig(AUDIO_MAL_DMA_CHANNEL, DMA_INT_HTF);
#endif /* AUDIO_MAL_DMA_IT_HT_EN */

#ifdef AUDIO_MAL_DMA_IT_TE_EN
    DMA_ITConfig(AUDIO_MAL_DMA_CHANNEL, DMA_INT_FTF | DMA_INT_HTF | DMA_INT_ERR);
#endif /* AUDIO_MAL_DMA_IT_TE_EN */

   /* enable the I2S DMA request */
   spi_dma_enable(CODEC_I2S, SPI_DMA_TRANSMIT);

#if defined(AUDIO_MAL_DMA_IT_TC_EN) || defined(AUDIO_MAL_DMA_IT_HT_EN) || defined(AUDIO_MAL_DMA_IT_TE_EN)
    /* I2S DMA IRQ channel configuration */
    nvic_irq_enable(AUDIO_MAL_DMA_IRQ, EVAL_AUDIO_IRQ_PREPRIO, EVAL_AUDIO_IRQ_SUBRIO);
#endif 
}

/*!
    \brief      restore default state of the used media
    \param[in]  none
    \param[out] none
    \retval     none
*/
void audio_mal_deinit(void)
{
#if defined(AUDIO_MAL_DMA_IT_TC_EN) || defined(AUDIO_MAL_DMA_IT_HT_EN) || defined(AUDIO_MAL_DMA_IT_TE_EN)
    NVIC_InitTypeDef NVIC_InitStructure;  

    /* deinitialize the NVIC interrupt for the I2S DMA Stream */
    NVIC_InitStructure.NVIC_IRQChannel = AUDIO_MAL_DMA_IRQ;
    NVIC_InitStructure.NVIC_IRQChannelPreemptionPriority = EVAL_AUDIO_IRQ_PREPRIO;
    NVIC_InitStructure.NVIC_IRQChannelSubPriority = EVAL_AUDIO_IRQ_SUBRIO;
    NVIC_InitStructure.NVIC_IRQChannelCmd = DISABLE;
    NVIC_Init(&NVIC_InitStructure);
#endif 

    /* disable the DMA channel before the deinitialize */
    dma_channel_disable(AUDIO_MAL_DMA, AUDIO_MAL_DMA_CHANNEL);

    /* deinitialize the DMA channel */
    dma_deinit(AUDIO_MAL_DMA, AUDIO_MAL_DMA_CHANNEL);

