CommunityGD32Cores/gigadevice-firmware-and-docs/GD32W51x/GD32W51x_RELEASE_V1.0.0/NSPE/Example/USBFS/usb_device/audio/src/audio_codec.c
    /* The DMA clock is not disabled, since it can be used by other streams */
}

/*!
    \brief      starts playing audio stream from the audio media
    \param[in]  addr: pointer to the audio stream buffer
    \param[in]  size: number of data in the audio stream buffer
    \param[out] none
    \retval     none
*/
void audio_mal_play(uint32_t addr, uint32_t size)
{
    /* disable the I2S DMA Stream*/
    dma_channel_disable(AUDIO_MAL_DMA, AUDIO_MAL_DMA_CHANNEL);

    /* clear the Interrupt flag */
    dma_interrupt_flag_clear(AUDIO_MAL_DMA, AUDIO_MAL_DMA_CHANNEL, DMA_INTC_FTFIFC);
    dma_interrupt_flag_clear(AUDIO_MAL_DMA, AUDIO_MAL_DMA_CHANNEL, DMA_INTC_HTFIFC);
    dma_interrupt_flag_clear(AUDIO_MAL_DMA, AUDIO_MAL_DMA_CHANNEL, DMA_INTC_TAEIFC);
    dma_interrupt_flag_clear(AUDIO_MAL_DMA, AUDIO_MAL_DMA_CHANNEL, DMA_INTC_SDEIFC);
    dma_interrupt_flag_clear(AUDIO_MAL_DMA, AUDIO_MAL_DMA_CHANNEL, DMA_INTC_FEEIFC);

    /* configure the buffer address and size */
    dma_initstructure.memory0_addr = (uint32_t)addr;
    dma_initstructure.number = (uint32_t)(size * 2U);

    /* configure the DMA Stream with the new parameters */
    dma_single_data_mode_init(AUDIO_MAL_DMA, AUDIO_MAL_DMA_CHANNEL, &dma_initstructure);

    /* enable the I2S DMA Stream*/
    dma_channel_enable(AUDIO_MAL_DMA, AUDIO_MAL_DMA_CHANNEL);

    /* if the i2s peripheral is still not enabled, enable it */
    if (0U == (SPI_I2SCTL(CODEC_I2S) & I2S_ENABLE_MASK)) {
        i2s_enable(CODEC_I2S);
    }
}

/*!
    \brief      pauses or resumes the audio stream playing from the media
    \param[in]  cmd: AUDIO_PAUSE (or 0) to pause, AUDIO_RESUME (or any value different
                from 0) to resume
    \param[in]  addr: address from/at which the audio stream should resume/pause
    \param[in]  size: number of data to be configured for next resume
    \param[out] none
    \retval     none
*/
void audio_mal_pause_resume(uint32_t cmd, uint32_t addr, uint32_t size)
{
    /* pause the audio file playing */
    if (AUDIO_PAUSE == cmd) {
        /* stop the current DMA request by resetting the I2S cell */
        codec_audio_interface_deinit();

        /* re-configure the I2S interface for the next resume operation */
        codec_audio_interface_init(i2s_audiofreq);

        /* disable the DMA Stream */
        dma_channel_disable(AUDIO_MAL_DMA, AUDIO_MAL_DMA_CHANNEL);
            
        /* clear the Interrupt flag */
        dma_flag_clear(AUDIO_MAL_DMA, AUDIO_MAL_DMA_CHANNEL, DMA_INTF_FTFIF | DMA_INTF_HTFIF | DMA_INTF_SDEIF | DMA_INTF_TAEIF);
    } else {
        /* configure the buffer address and size */
        dma_initstructure.memory0_addr = (uint32_t)addr;
        dma_initstructure.number = (uint32_t)(size * 2U);

        /* configure the DMA Stream with the new parameters */
        dma_single_data_mode_init(AUDIO_MAL_DMA, AUDIO_MAL_DMA_CHANNEL, &dma_initstructure);

        /* enable the I2S DMA Stream*/
        dma_channel_enable(AUDIO_MAL_DMA, AUDIO_MAL_DMA_CHANNEL);

        /* if the I2S peripheral is still not enabled, enable it */
        if (0U == (SPI_I2SCTL(CODEC_I2S) & I2S_ENABLE_MASK)) {
            i2s_enable(CODEC_I2S);
        }
    }
}

/*!
    \brief      stops audio stream playing on the used media
    \param[in]  none
    \param[out] none
    \retval     none
*/
void audio_mal_stop(void)
{
    /* stop the Transfer on the I2S side: Stop and disable the DMA stream */
    dma_channel_disable(AUDIO_MAL_DMA, AUDIO_MAL_DMA_CHANNEL);

    /* clear all the DMA flags for the next transfer */
    dma_flag_clear(AUDIO_MAL_DMA, AUDIO_MAL_DMA_CHANNEL, DMA_INTF_FTFIF | DMA_INTF_HTFIF | DMA_INTF_SDEIF | DMA_INTF_TAEIF);

    /* stop the current DMA request by resetting the I2S cell */
    codec_audio_interface_deinit();

    /* re-configure the I2S interface for the next play operation */
    codec_audio_interface_init(i2s_audiofreq);
}

/*!
    \brief      resets the audio codec. it restores the default configuration of the 
                codec (this function shall be called before initializing the codec)
    \note       this function calls an external driver function: The IO Expander driver
    \param[in]  none
    \param[out] none
    \retval     0 if correct communication, else wrong communication
*/
static void codec_reset(void)
{
    /* no operation */
}

/*!
    \brief      writes a byte to a given register into the audio codec through the control interface
    \param[in]  register_addr: the address (location) of the register to be written
    \param[in]  register_value: the byte value to be written into destination register
    \param[out] none
    \retval     0 if correct communication, else wrong communication
*/
static uint8_t codec_write_register(uint32_t RegisterAddr, uint32_t RegisterValue)
{
    uint8_t result = 0U;

    /* return the verifying value: 0 (passed) or 1 (failed) */
    return result;
}

#ifdef VERIFY_WRITTENDATA

/*!
    \brief      reads and returns the value of an audio codec register through the 
                control interface (I2C)
    \param[in]  register_addr: address of the register to be read
    \param[out] none
    \retval     value of the register to be read or dummy value if the communication fails
*/
static uint32_t codec_read_register(uint32_t RegisterAddr)
{
    uint32_t result = 0U;

    /* return the byte read from codec */
    return result;
}

#endif /* VERIFY_WRITTENDATA */

/*!
    \brief      initializes the Audio Codec control interface (I2C)
    \param[in]  none
    \param[out] none
    \retval     none
*/
static void codec_ctrl_interface_init(void)
{
    /* no operation */
}

/*!
    \brief      restore the audio codec control interface to its default state.
                this function doesn't deinitialize the i2c because the i2c peripheral
                may be used by other modules
    \param[in]  none
    \param[out] none
    \retval     none
*/
static void codec_ctrl_interface_deinit(void)
{
    /* no operation */
}

/*!
    \brief      initializes the audio codec audio interface (i2s)
    \note       this function assumes that the i2s input clock (through pll_r in 
                devices reva/z and through dedicated plli2s_r in devices revb/y)
                is already configured and ready to be used
    \param[in]  audio_freq: audio frequency to be configured for the i2s peripheral
    \param[out] none
    \retval     none
*/
static void codec_audio_interface_init(uint32_t audio_freq)
{
    i2s_audiofreq = audio_freq;
    /* enable the CODEC_I2S peripheral clock */
    rcu_periph_clock_enable(CODEC_I2S_CLK);

    /* cofigure i2s clock */
    rcu_hxtal_plli2s_enable();
    rcu_plli2s_config(48, RCU_PLLI2SSRC_DIV8, RCU_PLLI2S_DIV2);
    rcu_osci_on(RCU_PLLI2S_CK);
    while(0 == (RCU_CTL & RCU_CTL_PLLI2SSTB));
    rcu_i2s_clock_config(RCU_I2SSRC_PLLI2S);

