CommunityGD32Cores/gigadevice-firmware-and-docs/GD32W51x/GD32W51x_RELEASE_V1.0.0/NSPE/Example/USBFS/usb_device/audio/src/audio_codec.c
    /* CODEC_I2S peripheral configuration */
    spi_i2s_deinit(CODEC_I2S);

    /* initialize the I2S peripheral with the structure above */
    i2s_psc_config(CODEC_I2S, audio_freq, I2S_FRAMEFORMAT_DT16B_CH16B, 
#ifdef CODEC_MCLK_ENABLED
    I2S_MCKOUT_ENABLE
#elif defined(CODEC_MCLK_DISABLED)
    I2S_MCKOUT_DISABLE
#endif
    );

    i2s_init(CODEC_I2S, I2S_MODE_MASTERTX, I2S_STD_MSB, I2S_CKPL_HIGH);

    /* enable the I2S DMA TX request */
    spi_dma_enable( CODEC_I2S, SPI_DMA_TRANSMIT);
}

/*!
    \brief      restores the audio codec audio interface to its default state
    \param[in]  none
    \param[out] none
    \retval     none
*/
static void codec_audio_interface_deinit(void)
{
    /* disable the codec_i2s peripheral (in case it hasn't already been disabled) */
    i2s_enable(CODEC_I2S);

    /* deinitialize the codec_i2s peripheral */
    spi_i2s_deinit(CODEC_I2S);

    /* disable the codec_i2s peripheral clock */
    rcu_periph_clock_enable(CODEC_I2S_CLK);
}

/*!
    \brief      initializes IOs used by the audio codec (on the control and audio interfaces)
    \param[in]  none
    \param[out] none
    \retval     none
*/
static void codec_gpio_init(void)
{
    /* enable GPIO clock */
    rcu_periph_clock_enable(CODEC_I2S_WS_CLK);
    rcu_periph_clock_enable(RCU_GPIOB);
    rcu_periph_clock_enable(CODEC_I2S_SD_CLK);
    rcu_periph_clock_enable(RCU_SYSCFG);

    /* CODEC_I2S pins configuration: WS, SCK and SD pins */

    gpio_mode_set(CODEC_I2S_WS_GPIO, GPIO_MODE_AF, GPIO_PUPD_NONE, CODEC_I2S_WS_PIN);
    gpio_output_options_set(CODEC_I2S_WS_GPIO, GPIO_OTYPE_PP, GPIO_OSPEED_25MHZ, CODEC_I2S_WS_PIN);
    gpio_af_set(CODEC_I2S_WS_GPIO, GPIO_AF_0, CODEC_I2S_WS_PIN);


    gpio_af_set(GPIOB, GPIO_AF_5, GPIO_PIN_8);
    gpio_mode_set(GPIOB, GPIO_MODE_AF, GPIO_PUPD_NONE,  GPIO_PIN_8);
    gpio_output_options_set(GPIOB, GPIO_OTYPE_PP, GPIO_OSPEED_25MHZ, GPIO_PIN_8);


//    gpio_mode_set(CODEC_I2S_SCK_GPIO, GPIO_MODE_AF, GPIO_PUPD_NONE, CODEC_I2S_SCK_PIN);
//    gpio_output_options_set(CODEC_I2S_SCK_GPIO, GPIO_OTYPE_PP, GPIO_OSPEED_25MHZ, CODEC_I2S_SCK_PIN);
//    gpio_af_set(CODEC_I2S_SCK_GPIO, GPIO_AF_5, CODEC_I2S_SCK_PIN);


    gpio_mode_set(CODEC_I2S_SD_GPIO, GPIO_MODE_AF, GPIO_PUPD_NONE, CODEC_I2S_SD_PIN);
    gpio_output_options_set(CODEC_I2S_SD_GPIO, GPIO_OTYPE_PP, GPIO_OSPEED_25MHZ, CODEC_I2S_SD_PIN);
    gpio_af_set(CODEC_I2S_SD_GPIO, GPIO_AF_6, CODEC_I2S_SD_PIN);

#ifdef CODEC_MCLK_ENABLED
    /* enable GPIO clock */
    rcu_periph_clock_enable(CODEC_I2S_MCK_CLK);

    /* codec_i2s pins configuration: mck pin */
    gpio_mode_set(CODEC_I2S_MCK_GPIO, GPIO_MODE_AF, GPIO_PUPD_NONE, CODEC_I2S_MCK_PIN);
    gpio_output_options_set(CODEC_I2S_MCK_GPIO, GPIO_OTYPE_PP, GPIO_OSPEED_25MHZ, CODEC_I2S_MCK_PIN);
    gpio_af_set(CODEC_I2S_MCK_GPIO, GPIO_AF_2, CODEC_I2S_MCK_PIN);
#endif /* CODEC_MCLK_ENABLED */
}

/*!
    \brief      restores the IOs used by the audio codec interface to their default state
    \param[in]  none
    \param[out] none
    \retval     none
*/
static void codec_gpio_deinit(void)
{
    /* deinitialize all the GPIOs used by the driver (EXCEPT the I2C IOs since 
       they are used by the IOExpander as well) */
    gpio_mode_set(CODEC_I2S_SD_GPIO, GPIO_MODE_INPUT, GPIO_PUPD_NONE, CODEC_I2S_SD_PIN);
    gpio_mode_set(CODEC_I2S_WS_GPIO, GPIO_MODE_INPUT, GPIO_PUPD_NONE, CODEC_I2S_WS_PIN);
    gpio_mode_set(CODEC_I2S_SCK_GPIO, GPIO_MODE_INPUT, GPIO_PUPD_NONE, CODEC_I2S_SCK_PIN);

#ifdef CODEC_MCLK_ENABLED
    /* CODEC_I2S pins deinitialization: MCK pin */
    gpio_mode_set(CODEC_I2S_MCK_GPIO, GPIO_MODE_INPUT, GPIO_PUPD_NONE, CODEC_I2S_MCK_PIN);
#endif /* CODEC_MCLK_ENABLED */
}

/*!
    \brief      inserts a delay time (not accurate timing)
    \param[in]  none
    \param[out] none
    \retval     none
*/
static void delay(__IO uint32_t nCount)
{
  for (; nCount != 0U; nCount--){
  }
}
